Autodesk.Revit.UI.SnappingServers
Snapping Servers for elements like Point Clouds or Coordination Models.
Since:
2024
Since:
2024

Autodesk.Revit.UI.SnappingServers.CoordinationModel
Snapping to Coordination Models elements is enabled.

Autodesk.Revit.UI.SnappingServers.PointCloud
Snapping to Point Cloud elements is enabled.

Autodesk.Revit.UI.SnappingServers.None
No element snaps enabled.